{
    "name": "Justin Welsh",
    "subtitle": "Building my one-person business to $10M in revenue. Posts and articles about the process.",
    "location": "New York City Metropolitan Area",
    "about": "Over the last decade, I helped build two companies past a $1B valuation and raise over $300M in venture capital. Then, in 2019, I burned out.So, I decided to walk away from my high-paying executive job.But, before I could, I had a hypothesis.I believed building an audience online would be an incredible asset. That attention was the new currency and would play a major part in my success as an entrepreneur.So, I started building my brand on LinkedIn in early 2019. And the results were pretty phenomenal.In just 6 months I grew from zero followers to over 20,000.And on August 1st of 2019, I walked away from my executive role at a fast-growing startup.Since that day, I've spent my time building a number of one-person Internet businesses.My mission is to be the \"Diversified Solopreneur.\" My results:→ $6.7M+ in business revenue at a 90% profit margin.→ 550K+ people following my journey on LinkedIn→ 475K+ people following my journey on Twitter→ 215K+ people read my weekly newsletter→ 600M+ impressions in the last 4 yearsIf you want to learn more about how I did this, you can take one of my self-guided courses.THE OPERATING SYSTEM DIGITAL COURSEIn this 120-minute course, you will learn the complete LinkedIn operating system that I used to grow from 0 to 500k followers and earn $6.7M+ in income with zero advertisements. Join 20,000+ students and 40 LinkedIn Top Voices in the #1 rated LinkedIn course in the world.→ GO HERE: www.TheOperatingSystem.coTHE CONTENT OS DIGITAL COURSEIn this 85-minute course, you will learn the 8-part content creation machine behind 600M+ impressions on LinkedIn and Twitter, and building a 200,000+ subscriber newsletter. If you're looking for systems to produce 10-15 pieces of high-quality written content every single day, this is the course for you.→ GO HERE: www.justinwelsh.me/the-content-osEmail: support@justinwelsh.meX: @thejustinwelsh",
    "experiences": [
        [
            "Founder",
            "Justin Welsh · Self-employed",
            "Aug 2019 - Present · 4 yrs 10 mos",
            "New York, New York, United States · Remote",
            "Practical guidance to help you start and scale your one-person internet business."
        ],
        [
            "Writer",
            "The Saturday Solopreneur · Self-employed",
            "Jan 2022 - Present · 2 yrs 5 mos",
            "New York City Metropolitan Area",
            "215,000+ entrepreneurs read my business advice every Saturday morning.",
            "Subscribe to The Saturday Solopreneur | Justin Welsh",
            "← Join 215,000+ solopreneurs each week"
        ],
        [
            "Angel Investor",
            "ConvertKit",
            "Nov 2023 - Present · 7 mos"
        ],
        [
            "Angel Investor",
            "Spekit",
            "Dec 2021 - Present · 2 yrs 6 mos"
        ],
        [
            "Angel Investor",
            "Groundswell",
            "Sep 2021 - Present · 2 yrs 9 mos"
        ]
    ],
    "posts": [
        {
            "post": "Here are 12 powerful pieces of advice I'd give to aspiring internet entrepreneurs.  1. There is a business idea in your practical work experience, but also in the things you are obsessed with. Lean in.  2. Your unique value proposition is key to your success. Why should someone choose you over all of the people out there? (more here: https://lnkd.in/eX27xCZG)  3. Distribution is your best friend. If you can't share you message effectively, you're going to struggle.  4. Create content you enjoy creating, not what you think is \"best\". Like to write? Write. Like video? Record. Consistency is what matters, so you'd better like it.  5. Create systems and frameworks for turning your ideas into creative pieces of content that people will enjoy. No systems? Gonna be tough. (more here: https://lnkd.in/eGAABFwX)  6. Build for the long-term. Rather than trying to generate a ton of revenue right from the start, think about under-promising, under-pricing, and over-delivering. That early trust will pay off in the long run.  7. The more niche you are, the more you can sell products and services. The more broad you are, the more creative you'll have to get.  8. You become really good when you understand who you're serving, what you're helping them do, and what outcome they can expect. This becomes your content language. (more here: https://lnkd.in/eiwMuH3W)  9. You become great when you analyze everything you're doing, and form hypotheses about what's working and what isn't.  10. You become excellent when you take action against those hypotheses until you solve the problems.  11. Business is never \"done\". You're either moving forward or getting worse. The default mode in entrepreneurship is reverse.  12. Automation is the great differentiator. If your revenue can be generated by content and email sequences that work when you're sleeping, you'll be tough to beat.  Hope these are helpful.  Would love to hear some of your best advice.  If you enjoyed these, please reshare it to your timeline ♻️",
            "comments": [
                {
                    "author": "Justin Welsh",
                    "comment": "Side note: These are just 12 random lessons/advice that I could think of. A lot more where that came from and coming up in my journey (I'm sure). If you want to get these weekly, consider heading to my website (Click  'Visit my Website' at the top of the post) and subscribing to my newsletter or poking around a bit."
                },
                {
                    "author": "Louie Bernstein",
                    "comment": "Consistency brings mastery. + Doing what you like.= Happiness and success. 4th point is spot on, Justin Welsh."
                },
                {
                    "author": "Nir Eyal",
                    "comment": "Looks so easy when you lay it all out this way! Thanks"
                },
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "This is a master class in itself, Justin.Not many start with the end (Exit) in mind.Even if you don't want to, it helps to have it planned.Why? It nudges you to continuously increase business value."
                },
                {
                    "author": "Rajeev Mudumba",
                    "comment": "Justin Welsh list for execution"
                },
                {
                    "author": "Shaun Gordon",
                    "comment": "If you don't enjoy what you are doing, then there won't be any progress. Justin Welsh"
                },
                {
                    "author": "Christian Pobbig",
                    "comment": "Loved reading this, Justin! Point #6 hit different. Building for the long-term is like planting a tree. You don't see the fruits immediately, but with patience and care, it'll flourish. Reminds me of when I started blogging without expecting much in return, only to see it grow into a full-blown consulting gig over years. Patience pays off folks! What's your 'slow burn' success story?"
                },
                {
                    "author": "Mita Mallick",
                    "comment": "Unfortunately, between the copying of others and AI generated content, a lot of my feed is starting to look the same.Focus on being YOU! Be Authentic! 🙌🏾"
                },
                {
                    "author": "Temitope Olamide",
                    "comment": "Your unique value proposition is like your superpower in a world full of superheroes. Why should someone choose you over the rest? Because you bring something special to the table that no one else can replicate – your authentic self.And when it comes to creating content, it's all about staying true to who you are. Instead of trying to fit into a mold, focus on what lights you up and share that passion with the world. This is a piece worth referring to in the future so I'm saving this, Justin Welsh"
                },
                {
                    "author": "LP Bougie",
                    "comment": "Imposter sydrome takes over so quickly when we think of building something Justin Welsh. Lean in is in fact the motion that needs to happen."
                }
            ]
        },
        {
            "post": "In 2018, I made a decision that changed my life:I started building my personal brand on LinkedIn.Now, in 2024, we’ve got many more faces and voices on the platform...It’s become harder than ever to stand out and make a mark, but that doesn’t mean it’s impossible.You can do one thing to cut through the noise:Optimize your LinkedIn profile.Here’s how:https://lnkd.in/eW3JdQk4",
            "comments": [
                {
                    "author": "Rajeev Mudumba",
                    "comment": "Justin Welsh worth a read, again"
                },
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "Your LinkedIn profile is your business card. Even a resume. Polishing it is the wisest (and 1st) thing to do:- attract the right audience to your profile- answer their WIIFM question- get them to your listLoved the save-worthy profile optimization guide, Justin."
                },
                {
                    "author": "Andrew Stafford",
                    "comment": "Skills + personality + experience = personal brand"
                },
                {
                    "author": "Peter Sleightholme",
                    "comment": "3 simple tricks to get your LinkedIn headline clicks:- By your outcome-focussed ideal prospects ... - Using a proven copywriting formula:1. Ask a question (or maybe two)- The only question that works for a LinkedIn headline starts with “Want to … ”- So, starting with “Want to … ”- Add an emotive verb, such as “… IGNITE your …”- (this should refer to the big problem your prospect loses sleep over)-------2. Add the thing the emotive verb is referring to, and the big outcome your prospect wants, such as:- “ … LinkedIn (and stop losing sales)?”- So, this example becomes:- Want to IGNITE your LinkedIn (and stop losing sales)?-------- And you’ve got the first part of your:- WIIFM, benefit-rich, outcome-focussed, CRO’d headline. 😊-------3. Now, simply add your core offer:- How you solve your prospects big problem.- (the thing they desperately need, to get the outcome they want).- Such as: “Get Your LinkedIn Done for You as your 24/7 Sales Machine”.-------- And your CRO'd headline now reads, for example, as:- Want to IGNITE your [in] (& stop losing sales)? “Get Your LinkedIn Done for You as your 24/7 Sales Machine”. 😊PS. A 4th trick is to use \"Your\" and \"you\" as many times as possible."
                },
                {
                    "author": "Bipul Hossain",
                    "comment": "Couldn't agree more!In today's crowded LinkedIn landscape, having a well-optimized profile is crucial for standing out. Thanks for sharing the link to your guide"
                },
                {
                    "author": "Paweł Huryn 🇺🇦",
                    "comment": "Thanks for sharing, Justin. I'm unsure that those yellow badges add any credibility. When I see one, I understand the person got it for engaging with low-quality, AI-generated content. Often posting AI-generated answers.The badges are also misleading. LinkedIn uses them to promote their AI features, but doesn't explain to the users what they actually mean. It's a top AI Commentator, not the Top Voice. So, I have serious ethical doubts.Unfortunately I got one, they enabled it without asking for my permission. I saw it 2-3 hours later and hid it immediately.Dr Bart Jaworski, Jason Knight and other creators raised similar doubts."
                },
                {
                    "author": "Farhoon Asim",
                    "comment": "International students NEED to understand that their LinkedIn profile is the new CV...One of my Indian students got a job purely because of her LinkedIn profile.It's time we start taking LinkedIn seriously.Justin Welsh great guide :)"
                }
            ]
        },
        {
            "post": "Most successful entrepreneurs I know:  - Aren't that smart - Don't have MBAs - Don't come from money  They are just regular ol' people with a lot of confidence and a heavy bias for action.  If you believe you can do it?  And you take small steps to get there?  You can do it, too.  Take one small step today.  Start here: https://lnkd.in/e4hqzrwZ",
            "comments": [
                {
                    "author": "Justin Welsh",
                    "comment": "Side note: Some people ARE really smart and DO have MBAs. The point is, most people I know who are successful are both optimistic and action-oriented. If you think you can, and you actively go out and try, it's pretty hard to be a long-term 'failure' (whatever that means). If you're worried about action, try something small. One foot in front of the other for 5,000+ days."
                },
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "Self-confidence and bias for action - SO true, Justin. Grit and perseverance goes a long way in bringing great results."
                },
                {
                    "author": "Nir Eyal",
                    "comment": "Consistency over intensity. That’s what defines entrepreneurs."
                },
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "Self-confidence and heavy bias for action - SO true, Justin. Some doggedness goes a long way in bringing great results."
                },
                {
                    "author": "Rajeev Mudumba",
                    "comment": "Justin Welsh action trumps everything"
                },
                {
                    "author": "Kavin Prasath",
                    "comment": "I don't have an MBABut, I'm running a business, Justin Welsh"
                },
                {
                    "author": "Sannaan Kundi",
                    "comment": "Nobody's born king.You have to go through a lot of tests and trials to become who you want to become rather than what the world wants you to become, Justin Welsh"
                },
                {
                    "author": "Jonathan Corrales",
                    "comment": "Justin Welsh all people I've met that are wildly successful have one thing in common: they take action.They didn't waste energy doubting themselves. They didn't know if whatever they were doing would work out. They just did it. And they kept doing it."
                },
                {
                    "author": "Logan D. Freeman",
                    "comment": "This is 100% true - because the folks that don’t obsess about whatever others think, they are blind to it. And just believe in themselves. Using this exact framework for my CRE brokers course."
                },
                {
                    "author": "Michael Dillon",
                    "comment": "Are you a creator or a consumer?That is the question"
                }
            ]
        },
        {
            "post": "Working for yourself is really hard.  It often involves:  1. Wrestling with self-doubt, questioning if you're cut out for this.  2. Battling impostor syndrome, feeling like you don’t belong.  3. Juggling multiple responsibilities, trying to keep all balls in the air.  4. Navigating financial challenges, which can be scary as hell.  Yes, it's hard.  But truth be told, every path is hard.  So pause...and give yourself some time to think:  Are the challenges you're working on in your current career fulfilling?  If the answer is no, it's never too late to build something new. Something small that may, someday, be something big.  Today is the perfect time to embrace change and choose the 'right hard' for your journey.  Are you?  If so, read this: https://lnkd.in/eYC-5JcC",
            "comments": [
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "True. Nothing worthwhile in life comes easy.But you can learn to enjoy the hard by:- Developing a growth mindset- Aligning it with your life purpose- Converting the work into a routineThanks for the reminder, Justin."
                },
                {
                    "author": "Rajeev Mudumba",
                    "comment": "Justin Welsh choose a hard that works for you and you can work for"
                },
                {
                    "author": "James Balicki",
                    "comment": "Love the honest reflection on the realities of working for yourself. It's refreshing to see someone openly acknowledge the struggles that often accompany entrepreneurship."
                },
                {
                    "author": "Amy Sylvis",
                    "comment": "Choose your hard is one of the most effective frameworks I've ever used in my life. Doing my daily breathing treatments for hashtag#cysticfibrosis is hard (and a PITA). But losing my life early because of lung failure is harder.Going to the gym to lift heavy weighs several times a week is hard. But having to inject insulin several times a day due to CF related diabetes and risk low blood sugars is harder. Building an investment company is hard. But relying on a W-2 where I don't have freedom or income that keeps up with inflation is harder.I GET TO CHOOSE MY HARD."
                },
                {
                    "author": "Sneha Mandala",
                    "comment": "Essentially, challenges are everywhere. But there are challenges that DRAIN YOU. 😩& there’re challenges that ENERGIZE YOU. 🤩Fill your life ENERGIZING challenges."
                },
                {
                    "author": "R Dilip Kumar",
                    "comment": "Nothing is easy in life. We might look at others and feel that they got things pretty easily.But if you talk to them, you will find that they too went through the grind to achieve what they did.Working for someone, building their dream is hard. You choose that over building your dreams because you thought that it might be easy, only to realize that it isn't.So, if you think that starting a solopreneurship is going to be hard, then you need to ask yourself, if that is the \"hard\" that you would want to choose, considering you have already seen what your earlier choice gave you.It is \"Your dreams\" Vs \"Somebody else's dreams\".The choice is clear!"
                },
                {
                    "author": "Areeba Ashraf",
                    "comment": "It's true, every path is hard, but recognizing the 'right hard' is the first step towards a fulfilling journey."
                },
                {
                    "author": "Matt Rebeiro",
                    "comment": "Because when you …Choose Your Hard …Winning becomes easy(Well easier relatively speaking)Because choosing gives you …Direction and from direction comes Focus!"
                },
                {
                    "author": "Ruchi Pundhir",
                    "comment": "Your raw honesty about the challenges of working for yourself resonates deeply. It's a path fraught with self-doubt, imposter syndrome, and the relentless juggle of responsibilities and financial uncertainties. But amidst the struggle, there's a powerful reminder: \"Every path is hard and Every step is looking like a mistake but Keep going, continuity is the KEY\"From my experience, I've found that embracing these challenges can lead to tremendous growth and fulfillment. It's about choosing the 'right hard' for your journey—aligning your efforts with what truly fulfills you. And if your current career path doesn't align with your passions and aspirations, it's never too late to pivot. Embracing challenges fosters personal growth: Facing and overcoming obstacles often leads to greater resilience and self-discovery.hashtag#Chooseyourhard"
                }
            ]
        },
        {
            "post": "'Big Company' priorities:  - Job title - Quota attainment - Salary + commission - Number of direct reports - What co-workers think of you  Solopreneur priorities:  - Health - Network - Free time - Creativity - Time with family - Location independence  A beautiful shift.  In business we're taught to 'maximize' everything:  - Our profits - Our career growth - Our shareholder value - How much money we make  In Solopreneurship, it's the opposite.  It's not about getting more.  It's about having enough.  If that sounds good, do what I did:  1. Reflect on your values and aspirations. 2. Identify your business goals. 3. Evaluate your current situation. 4. Define your 'enough'.  Here's how: https://lnkd.in/e6DbPFvi",
            "comments": [
                {
                    "author": "Justin Welsh",
                    "comment": "Side note: There is nothing wrong with working for a company, big or small. It's just always good to remember that profit is the primary driver of nearly everything. When you work for yourself (yes, it's hard) you can choose to continue driving for profit only...or you can choose to focus on building a high-quality life and then figuring out how to support that with enough profit. No wrong choice. Just different."
                },
                {
                    "author": "Shiv Shenoy, PMP",
                    "comment": "What truly matters is maximizing life, Justin.And that happens when:- you draw intrinsic joy from your work- you have aligned life priorities with work- your work becomes an extension of yourself"
                },
                {
                    "author": "Nir Eyal",
                    "comment": "Congrats on your amazing success!"
                },
                {
                    "author": "Louie Bernstein",
                    "comment": "Turns out, what you ended up being, Justin, was helpful and useful. A much better position in life. Well done."
                },
                {
                    "author": "Rajeev Mudumba",
                    "comment": "Justin Welsh go for what’s important to you"
                },
                {
                    "author": "Sahil Bloom",
                    "comment": "Having the freedom to slow down and enjoy the simple things in life is my definition of enough."
                },
                {
                    "author": "Brad Davis",
                    "comment": "Enough.Love that. Money has a diminishing return the more and more you make, however unhappy people think \"no my next million or next 10 million will be 'enough'\".Inner peace cannot be bought."
                },
                {
                    "author": "Justin Nelson",
                    "comment": "It's such a big mental shift going from corporate to solopreneurship because you inadvertently bring all of the deadlines, quotas, etc with you! 🤔"
                },
                {
                    "author": "Gunnar Habitz",
                    "comment": "For all of us happy employees it is key to find the right balance between those two extremes."
                },
                {
                    "author": "Twinkle Dixit",
                    "comment": "I have found my \"Why\"--What value I want to give to other people. And when we find that out, it's the sweetest ride. It's not about making a lot of money, it's about genuinely helping people with the things you helped yourself."
                }
            ]
        }
    ]
}